In [1]:
!ls

movies.ipynb	    title.basics.tsv	 title.crew.tsv.gz
name.basics.tsv     title.basics.tsv.gz  title.ratings.tsv
name.basics.tsv.gz  title.crew.tsv	 title.ratings.tsv.gz

In [33]:
import pandas as pd
import numpy as np

In [4]:
title_crew=pd.read_csv('title.crew.tsv',sep='\t')
title_ratings=pd.read_csv('title.ratings.tsv',sep='\t')
title_basics=pd.read_csv('title.basics.tsv',sep='\t')
name_basics=pd.read_csv('name.basics.tsv',sep='\t')

/home/mahdi/w/data-analysis-course/.env/lib/python3.8/site-packages/IPython/core/interactiveshell.py:3145: DtypeWarning: Columns (5) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [21]:
title_ratings  = title_ratings.set_index('tconst')
title_basics = title_basics.set_index('tconst')

KeyError: "None of ['tconst'] are in the columns"

In [26]:
joined = title_basics.join(title_ratings)

In [35]:
name_basics = name_basics[name_basics['knownForTitles'] != '\\N']

In [38]:
name_basics = name_basics.dropna()

In [58]:
name_basics.loc[0, 'knownForTitles'].split(',')

['tt0053137', 'tt0031983', 'tt0072308', 'tt0050419']

In [59]:
titles = name_basics.loc[0, 'knownForTitles'].split(',')
title_basics.loc[titles, :]

,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
tconst,,,,,,,,
tt0053137,movie,On the Beach,On the Beach,0,1959,\N,134,"Drama,Romance,Sci-Fi"
tt0031983,movie,The Story of Vernon and Irene Castle,The Story of Vernon and Irene Castle,0,1939,\N,93,"Biography,Drama,Musical"
tt0072308,movie,The Towering Inferno,The Towering Inferno,0,1974,\N,165,"Action,Drama,Thriller"
tt0050419,movie,Funny Face,Funny Face,0,1957,\N,103,"Comedy,Musical,Romance"